<a href="https://colab.research.google.com/github/Hussainaquib/Python-Programs/blob/main/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**PANDAS**

**Cearte a Series**

To create a series using list or tuple or dictionary

In [ ]:
# create series object from a list

import pandas as pd
a = pd.Series(['mark','Rita','Vicki','Justin','John','Michal'])
print(a)

0      mark
1      Rita
2     Vicki
3    Justin
4      John
5    Michal
dtype: object

In [ ]:
# create a series object from a tuple

a = pd.Series(('Mark','Rita','Vicki','Justin','John','Michal'))
print(a)

0      Mark
1      Rita
2     Vicki
3    Justin
4      John
5    Michal
dtype: object

In [ ]:
# create a series using dictionary

D = {'a':'Mark','b':'Rita','c':'Vicki','d':'Justin','e':'John','f':'Michal',}
a = pd.Series(D)
print(a)

a      Mark
b      Rita
c     Vicki
d    Justin
e      John
f    Michal
dtype: object

To create a series using nimpy ndarray

In [ ]:
import pandas as pd
import numpy as np

a = np.array([100,200,300,400,500,600])
b = pd.Series(a,index=['a','b','c','d','e','f'])
print(b)

a    100
b    200
c    300
d    400
e    500
f    600
dtype: int64

In [ ]:
s = pd.Series(np.random.randn(5),index=['a','b','c','d','e'])
print(s)

a    0.404275
b    1.073623
c   -0.627213
d   -0.992742
e   -0.289297
dtype: float64

3 - Create series using Scalar Values

In [ ]:
a = pd.Series(2)
print(a)
print("\n")
b = pd.Series(5.0,index=['a','b','c','d','e'])
print(b)

0    2
dtype: int64


a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

**Set the custum index in Series**

In [ ]:
import pandas as pd

a = pd.Series(['Mark','Rita','Vicki','Justin','John','Michal'],index = ['a','b','c','d','e','f'])
print(a)

a      Mark
b      Rita
c     Vicki
d    Justin
e      John
f    Michal
dtype: object

**Set the custum data type of values**

In [ ]:
import pandas as pd
import numpy as np

a = np.array([100,200,300,400,500,600])
b = pd.Series(a,index=['a','b','c','d','e','f'], dtype = float)
print(b)

a    100.0
b    200.0
c    300.0
d    400.0
e    500.0
f    600.0
dtype: float64

**Create series with mixed data type values**

In [ ]:
a = pd.Series(['Mark',100,'Tokyo',89.22])
print(a)

0     Mark
1      100
2    Tokyo
3    89.22
dtype: object

**Set the name of series , find size of series , check series is empty or not**

In [ ]:
import pandas as pd

a = pd.Series(['Mark','Rita','Vicki','Justin','John','Michal'],index = ['a','b','c','d','e','f'], name = "Student")
print(a)
print("\n")

# for access the name of the Series object
print(a.name)
print("\n")

# for change the name of series
a.name = 'User'
print(a)
print("\n")

# to get the number of element in series
print(a.size)
print("\n")

# to check series is empty or not
print(a.empty)

a      Mark
b      Rita
c     Vicki
d    Justin
e      John
f    Michal
Name: Student, dtype: object


Student


a      Mark
b      Rita
c     Vicki
d    Justin
e      John
f    Michal
Name: User, dtype: object


6


False

**To get first and last N elements of Series**

In [ ]:
import pandas as pd

a = pd.Series(['Mark','Rita','Vicki','Justin','John','Michal'],index = ['a','b','c','d','e','f'], name = "Student")
print(a)
print("\n")

# get first 3 elements of series
subset = a.head(3)
print(subset)
print("\n")

# get last 3 elements of series
subset = a.tail(3)
print(subset)
print("\n")

a      Mark
b      Rita
c     Vicki
d    Justin
e      John
f    Michal
Name: Student, dtype: object


a     Mark
b     Rita
c    Vicki
Name: Student, dtype: object


d    Justin
e      John
f    Michal
Name: Student, dtype: object

**Get the count of non NaN (Not a Number) values**

In [ ]:
import pandas as pd
import numpy as np

y = pd.Series(['Mark','np.NaN','Vicki','Justin','np.NaN','Michal'])
print(y)
print("\n")
z = y.count()
print(z)

0      Mark
1    np.NaN
2     Vicki
3    Justin
4    np.NaN
5    Michal
dtype: object


6

**Indexing Series Elements / Accessing Series Elements**

**1- Positional indexing**

**2- Label names**

(A) - Accessing Series elements using Positional Indexing

In [ ]:
# accessing single element
import pandas as pd
names = pd.Series(['Mark','Rita','Vicki','Justin','John','Michal'],index = ['a','b','c','d','e','f'])
print(names)
print("\n")
first_element = names[0]
print('First Element:',first_element)

third_element = names[2]
print('Third Element:',third_element)

a      Mark
b      Rita
c     Vicki
d    Justin
e      John
f    Michal
dtype: object


First Element: Mark
Third Element: Vicki

In [ ]:
# accessing multiple elements of series by specific index position
import pandas as pd
names = pd.Series(['Mark','Rita','Vicki','Justin','John','Michal'],index = ['a','b','c','d','e','f'])
print(names)
print("\n")
few_names = names[[2,3,0]]
print(few_names)

a      Mark
b      Rita
c     Vicki
d    Justin
e      John
f    Michal
dtype: object


c     Vicki
d    Justin
a      Mark
dtype: object

(B) - Accessing Series elements using Label names

In [ ]:
# accessing single elements
import pandas as pd
names = pd.Series(['Mark','Rita','Vicki','Justin','John','Michal'],index = ['a','b','c','d','e','f'])
print(names)
print("\n")
print(names['d'])

a      Mark
b      Rita
c     Vicki
d    Justin
e      John
f    Michal
dtype: object


Justin

In [ ]:
# accessing multiple elements
import pandas as pd
names = pd.Series(['Mark','Rita','Vicki','Justin','John','Michal'],index = ['a','b','c','d','e','f'])
print(names)
print("\n")
few_names = names[['d','e','a']]
print(few_names)

a      Mark
b      Rita
c     Vicki
d    Justin
e      John
f    Michal
dtype: object


d    Justin
e      John
a      Mark
dtype: object

(C) - Accessing subset of Series using index/Label Range (Slicing)

In [ ]:
# by using Index
import pandas as pd
names = pd.Series(['Mark','Rita','Vicki','Justin','John','Michal'],index = ['a','b','c','d','e','f'])
print(names)
print("\n")
few_names = names[1:4]
print(few_names)

a      Mark
b      Rita
c     Vicki
d    Justin
e      John
f    Michal
dtype: object


b      Rita
c     Vicki
d    Justin
dtype: object

In [ ]:
# by using label range
import pandas as pd
names = pd.Series(['Mark','Rita','Vicki','Justin','John','Michal'],index = ['a','b','c','d','e','f'])
print(names)
print("\n")
few_names = names['b':'e']
print(few_names)

a      Mark
b      Rita
c     Vicki
d    Justin
e      John
f    Michal
dtype: object


b      Rita
c     Vicki
d    Justin
e      John
dtype: object

**Change single element in Series**

(A)- Changing single element in series by index position

In [ ]:
import pandas as pd
names = pd.Series(['Mark','Rita','Vicki','Justin','John','Michal'],index = ['a','b','c','d','e','f'])
print(names)
print("\n")
names[2] = 'Sanjay'
print(names)

a      Mark
b      Rita
c     Vicki
d    Justin
e      John
f    Michal
dtype: object


a      Mark
b      Rita
c    Sanjay
d    Justin
e      John
f    Michal
dtype: object

(B)- Change single element in series by label value

In [ ]:
import pandas as pd
names = pd.Series(['Mark','Rita','Vicki','Justin','John','Michal'],index = ['a','b','c','d','e','f'])
print(names)
print("\n")
names['e'] = 'sabbo'
print(names)

a      Mark
b      Rita
c     Vicki
d    Justin
e      John
f    Michal
dtype: object


a      Mark
b      Rita
c     Vicki
d    Justin
e     sabbo
f    Michal
dtype: object

(C)- Change multiple element in Series

In [ ]:
import pandas as pd
names = pd.Series(['Mark','Rita','Vicki','Justin','John','Michal'],index = ['a','b','c','d','e','f'])
print(names)
print()

names[0:3] = 'John Doe'
print(names)
print()

names['a':'d'] = 'Smriti'
print(names)

a      Mark
b      Rita
c     Vicki
d    Justin
e      John
f    Michal
dtype: object

a    John Doe
b    John Doe
c    John Doe
d      Justin
e        John
f      Michal
dtype: object

a    Smriti
b    Smriti
c    Smriti
d    Smriti
e      John
f    Michal
dtype: object

**Deleting elements from series**

In [ ]:
import pandas as pd
names = pd.Series(['Mark','Rita','Vicki','Justin','John','Michal'],index = ['a','b','c','d','e','f'])
print(names)
print("\n")
names = names.drop(['b','c','e'])
print('modified series')
print(names)

a      Mark
b      Rita
c     Vicki
d    Justin
e      John
f    Michal
dtype: object


modified series
a      Mark
d    Justin
f    Michal
dtype: object

**Write a pandas program to add,subtract,multiple and divide two Pandas Series**

In [ ]:
import pandas as pd
n1 = pd.Series([2,4,6,8,10])
n2 = pd.Series([1,3,5,7,9])
n = n1+n2
print("Add two Series:")
print(n)
n = n1-n2
print("Subtract two Series:")
print(n)
n = n1*n2
print("Multiply two Series:")
print(n)
n = n1/n2
print("Divide two Series:")
print(n)

Add two Series:
0     3
1     7
2    11
3    15
4    19
dtype: int64
Subtract two Series:
0    1
1    1
2    1
3    1
4    1
dtype: int64
Multiply two Series:
0     2
1    12
2    30
3    56
4    90
dtype: int64
Divide two Series:
0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

**Write a pandas program to compare the elements of the two Pandas Series**

In [ ]:
import pandas as pd
n1 = pd.Series([2,4,6,8,10])
n2 = pd.Series([1,3,5,7,10])
print("Series1:")
print(n1)
print("Series2:")
print(n2)
print("Compare the elements of the said Series:")
print("Equals:")
print(n1 == n2)
print("Greater than:")
print(n1>n2)
print("Less than:")
print(n1<n2)

Series1:
0     2
1     4
2     6
3     8
4    10
dtype: int64
Series2:
0     1
1     3
2     5
3     7
4    10
dtype: int64
Compare the elements of the said Series:
Equals:
0    False
1    False
2    False
3    False
4     True
dtype: bool
Greater than:
0     True
1     True
2     True
3     True
4    False
dtype: bool
Less than:
0    False
1    False
2    False
3    False
4    False
dtype: bool

**Adding/Merging Series together**

In [ ]:
import pandas as pd
first = pd.Series([100,200,300,400,500],index = ['a','b','e','f','g'])
second = pd.Series([11,12,13,14],index = ['a','b','h','i'])
total = first.add(second)
print(total)

a    111.0
b    212.0
e      NaN
f      NaN
g      NaN
h      NaN
i      NaN
dtype: float64

In [ ]:
import pandas as pd
first = pd.Series([100,200,300,400,500],index = ['a','b','e','f','g'])
second = pd.Series([11,12,13,14],index = ['a','b','h','i'])
total  =first.add(second,fill_value=0)
print(total)

a    111.0
b    212.0
e    300.0
f    400.0
g    500.0
h     13.0
i     14.0
dtype: float64

In [ ]:
import pandas as pd
import numpy as np
first = pd.Series([100,200,300,400,500],index = ['a','b','e','f','g'])
second = pd.Series([11,np.NaN,13,34],index = ['a','b','h','i'])
total = first.add(second,fill_value=0)
print(total)

a    111.0
b    200.0
e    300.0
f    400.0
g    500.0
h     13.0
i     34.0
dtype: float64

**Different methods of creating the DataFrame**

Creating empty Dataframe

In [ ]:
import pandas as pd
d = pd.DataFrame()
print(d)

Empty DataFrame
Columns: []
Index: []

Method-1. Creating a DataFrame using single tuple/list

In [ ]:
# creating DataFrame using the Tuple
df = pd.DataFrame(('python','for','data','science','AI','ML','DL'))
print(df)

         0
0   python
1      for
2     data
3  science
4       AI
5       ML
6       DL

In [ ]:
# creating DataFrame using list
df = pd.DataFrame(['python','for','data','science','AI','ML','DL'])
print(df)

         0
0   python
1      for
2     data
3  science
4       AI
5       ML
6       DL

Method-2. Creating DataFrame using a list of list

In [ ]:
df = pd.DataFrame([['alex',10],['Bob',12],['clarke',13]])
print(df)

        0   1
0    alex  10
1     Bob  12
2  clarke  13

Method-3. Creating DataFrame using a list of dictionary

In [ ]:
df = pd.DataFrame([{'alex':10,'bob':20,'clarke':30},{'bob':12},{'clarke':13}])
print(df)

   alex   bob  clarke
0  10.0  20.0    30.0
1   NaN  12.0     NaN
2   NaN   NaN    13.0

Method-4. Creating a DataFrame using dictionary of lists

In [ ]:
df = pd.DataFrame({'Name':['tom','nick','krish','jack'],'Age':[20,21,19,18]})
print(df)

    Name  Age
0    tom   20
1   nick   21
2  krish   19
3   jack   18

Method-5. Creating a DataFrame using a NumPy array

In [ ]:
import numpy as np
df = pd.DataFrame({
    'name':['jane','john','ashley','mike','emily','jack','catlin'],
    'ctg':['A','A','C','B','B','C','B'],
    'val':np.random.random(7).round(2),
    'val2':np.random.randint(1,10,size=7),
    'val3':np.array(['aditya',20,'a',30,'emily',40,50])
})
print(df)

     name ctg   val  val2    val3
0    jane   A  0.68     6  aditya
1    john   A  0.09     9      20
2  ashley   C  0.83     6       a
3    mike   B  0.13     3      30
4   emily   B  0.85     4   emily
5    jack   C  0.02     4      40
6  catlin   B  0.80     7      50

Method-6. Creating DataFrame using Series

In [ ]:
import pandas as pd
a = pd.DataFrame(pd.Series(['jit','purn','arp','jot']))
print(a)

      0
0   jit
1  purn
2   arp
3   jot

Method-7. Creating DataFrame using .csv files

In [ ]:
import pandas as pd
df = pd.read_csv('/content/drive/MyDrive/nba.csv')
print(df)

     Unnamed: 0            Name                    Team  Number Position  \
0           152    Aaron Brooks           Chicago Bulls     0.0       PG
1           356    Aaron Gordon           Orlando Magic     0.0       PF
2           328  Aaron Harrison       Charlotte Hornets     9.0       SG
3           404   Adreian Payne  Minnesota Timberwolves    33.0       PF
4           312      Al Horford           Atlanta Hawks    15.0        C
..          ...             ...                     ...     ...      ...
453         270  Xavier Munford       Memphis Grizzlies    14.0       PG
454         402     Zach LaVine  Minnesota Timberwolves     8.0       PG
455         271   Zach Randolph       Memphis Grizzlies    50.0       PF
456         237   Zaza Pachulia        Dallas Mavericks    27.0        C
457         457             NaN                     NaN     NaN      NaN

      Age Height  Weight         College      Salary
0    31.0    6-0   161.0          Oregon   2250000.0
1    20.0    6-9   220.0         Arizona   4171680.0
2    21.0    6-6   210.0        Kentucky    525093.0
3    25.0   6-10   237.0  Michigan State   1938840.0
4    30.0   6-10   245.0         Florida  12000000.0
..    ...    ...     ...             ...         ...
453  24.0    6-3   180.0    Rhode Island         NaN
454  21.0    6-5   189.0            UCLA   2148360.0
455  34.0    6-9   260.0  Michigan State   9638555.0
456  32.0   6-11   275.0             NaN   5200000.0
457   NaN    NaN     NaN             NaN         NaN

[458 rows x 10 columns]

Creating DataFrame using another DataFrame

Data alignment and arithematic

In [ ]:
import numpy as np
import pandas as pd
df = pd.DataFrame(np.random.randn(8,4),columns=['P','Q','R','S'])
df2 = pd.DataFrame(np.random.randn(9,3),columns=['P','Q','R'])
print(df+df2)
print("\n")
print(df*4+2)
print("\n")
print(1/df)
print("\n")

          P         Q         R   S
0  0.015987  2.506446  1.399979 NaN
1  0.745662  0.748497  2.208159 NaN
2  0.890962  0.482449  1.952628 NaN
3 -1.830965  2.029272  1.242993 NaN
4  0.205828  0.655799  2.364391 NaN
5 -0.451550 -0.775220  0.468155 NaN
6 -0.996565 -0.165404 -0.160962 NaN
7 -1.561832  1.065028  0.890705 NaN
8       NaN       NaN       NaN NaN


          P          Q         R         S
0  1.766822  12.975577  2.661344  5.414699
1  4.128409   1.473878  2.282290  5.007647
2  5.977301  -0.343078  8.947454 -0.458135
3 -2.688613   5.255462  5.090044 -4.188292
4  2.776849   2.504727  2.528696  3.261759
5  2.663063  -1.081473  5.447324  5.311768
6  0.152818  -0.447368 -1.282984  5.095811
7 -2.980730   5.471808  1.228065 -3.317148


           P         Q          R         S
0 -17.154282  0.364446   6.048294  1.171406
1   1.879338 -7.602796  14.169838  1.329943
2   1.005707 -1.707156   0.575750 -1.627250
3  -0.853131  1.228704   1.294480 -0.646382
4   5.149008  7.925084   7.565787  3.170177
5   6.032609 -1.298081   1.160320  1.207814
6  -2.165460 -1.634409  -1.218404  1.292068
7  -0.803095  1.152137  -5.181781 -0.752283

In [ ]:
import numpy as np
import pandas as pd
df = pd.DataFrame(np.random.randn(8,4),columns=['P','Q','R','S'])
df2 = pd.DataFrame(np.random.randn(9,3),columns=['P','Q','R'])
print(df.round(2))
df1 = df **2
print("\n")
print(df1)
print("\n")
print(df1.round(2))

      P     Q     R     S
0  0.65  1.47 -0.29 -0.07
1  0.38 -1.46  0.05 -0.63
2  0.60 -0.76 -0.58  0.67
3 -1.05 -0.25 -1.03 -1.04
4 -0.16 -0.09 -1.41  1.57
5 -0.59 -1.62 -0.10  1.19
6  0.46  0.01  1.28 -0.21
7  0.82  0.45  1.19 -0.82


          P         Q         R         S
0  0.420371  2.169177  0.081531  0.004264
1  0.141970  2.117542  0.002390  0.399900
2  0.355192  0.572339  0.334277  0.452920
3  1.103541  0.062580  1.067659  1.082974
4  0.027133  0.008733  1.982626  2.457847
5  0.346030  2.624944  0.010615  1.427282
6  0.215798  0.000058  1.638529  0.043711
7  0.665894  0.204586  1.406006  0.669373


      P     Q     R     S
0  0.42  2.17  0.08  0.00
1  0.14  2.12  0.00  0.40
2  0.36  0.57  0.33  0.45
3  1.10  0.06  1.07  1.08
4  0.03  0.01  1.98  2.46
5  0.35  2.62  0.01  1.43
6  0.22  0.00  1.64  0.04
7  0.67  0.20  1.41  0.67

Boolean operator on DataFrame

In [ ]:
df1 = pd.DataFrame({'x':[1,0,1],'y':[0,1,1]},dtype = bool )
df2 = pd.DataFrame({'x':[0,1,1],'y':[1,1,0]},dtype = bool )
print(df1 & df2)
print("\n")
print(df1 | df2)
print("\n")
print(df1 ^ df2)
print("\n")
print(-df1)

       x      y
0  False  False
1  False   True
2   True  False


      x     y
0  True  True
1  True  True
2  True  True


       x      y
0   True   True
1   True  False
2  False   True


       x      y
0  False   True
1   True  False
2  False  False

**Methods of indexing/selection in pandas DataFrame using DataFrame.[] , DataFrame.loc[] and DataFrame.iloc[]**

In [ ]:
import pandas as pd
df = pd.read_csv('/content/drive/MyDrive/nba.csv')
print(df)

     Unnamed: 0            Name                    Team  Number Position  \
0           152    Aaron Brooks           Chicago Bulls     0.0       PG
1           356    Aaron Gordon           Orlando Magic     0.0       PF
2           328  Aaron Harrison       Charlotte Hornets     9.0       SG
3           404   Adreian Payne  Minnesota Timberwolves    33.0       PF
4           312      Al Horford           Atlanta Hawks    15.0        C
..          ...             ...                     ...     ...      ...
453         270  Xavier Munford       Memphis Grizzlies    14.0       PG
454         402     Zach LaVine  Minnesota Timberwolves     8.0       PG
455         271   Zach Randolph       Memphis Grizzlies    50.0       PF
456         237   Zaza Pachulia        Dallas Mavericks    27.0        C
457         457             NaN                     NaN     NaN      NaN

      Age Height  Weight         College      Salary
0    31.0    6-0   161.0          Oregon   2250000.0
1    20.0    6-9   220.0         Arizona   4171680.0
2    21.0    6-6   210.0        Kentucky    525093.0
3    25.0   6-10   237.0  Michigan State   1938840.0
4    30.0   6-10   245.0         Florida  12000000.0
..    ...    ...     ...             ...         ...
453  24.0    6-3   180.0    Rhode Island         NaN
454  21.0    6-5   189.0            UCLA   2148360.0
455  34.0    6-9   260.0  Michigan State   9638555.0
456  32.0   6-11   275.0             NaN   5200000.0
457   NaN    NaN     NaN             NaN         NaN

[458 rows x 10 columns]

(A) indexing/selection a DataFrame using indexing operator [ ]

In [ ]:
# Selecting a single columns

df = pd.read_csv('/content/drive/MyDrive/nba.csv',index_col = "Name")
a = df['Team']
print(a)

Name
Aaron Brooks               Chicago Bulls
Aaron Gordon               Orlando Magic
Aaron Harrison         Charlotte Hornets
Adreian Payne     Minnesota Timberwolves
Al Horford                 Atlanta Hawks
                           ...
Xavier Munford         Memphis Grizzlies
Zach LaVine       Minnesota Timberwolves
Zach Randolph          Memphis Grizzlies
Zaza Pachulia           Dallas Mavericks
NaN                                  NaN
Name: Team, Length: 458, dtype: object

In [ ]:
# Selecting multiple columns

df = pd.read_csv('/content/drive/MyDrive/nba.csv',index_col = "Name")
first = df[["Age","College","Salary"]]
print(first)

                 Age         College      Salary
Name
Aaron Brooks    31.0          Oregon   2250000.0
Aaron Gordon    20.0         Arizona   4171680.0
Aaron Harrison  21.0        Kentucky    525093.0
Adreian Payne   25.0  Michigan State   1938840.0
Al Horford      30.0         Florida  12000000.0
...              ...             ...         ...
Xavier Munford  24.0    Rhode Island         NaN
Zach LaVine     21.0            UCLA   2148360.0
Zach Randolph   34.0  Michigan State   9638555.0
Zaza Pachulia   32.0             NaN   5200000.0
NaN              NaN             NaN         NaN

[458 rows x 3 columns]

(B) Indexing/selection a DataFrame using .loc[ ]

In [ ]:
# selcting a single row

df = pd.read_csv('/content/drive/MyDrive/nba.csv',index_col = "Name")
first = df.loc["Avery Bradley"]
second = df.loc["R.J. Hunter"]
first

Unnamed: 0                 0
Team          Boston Celtics
Number                   0.0
Position                  PG
Age                     25.0
Height                   6-2
Weight                 180.0
College                Texas
Salary             7730337.0
Name: Avery Bradley, dtype: object

In [ ]:
# Selcting multiple rows

df = pd.read_csv('/content/drive/MyDrive/nba.csv',index_col = "Name")
first = df.loc[["Avery Bradley","Aaron Brooks"]]
first

,Unnamed: 0,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,,
Avery Bradley,0,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Aaron Brooks,152,Chicago Bulls,0.0,PG,31.0,6-0,161.0,Oregon,2250000.0

In [ ]:
# Selecting two rows and three columns

df = pd.read_csv('/content/drive/MyDrive/nba.csv',index_col = "Name")
first = df.loc[["Avery Bradley","Aaron Brooks"],["Team","Number","Position"]]
first

                         Team  Number Position
Name
Avery Bradley  Boston Celtics     0.0       PG
Aaron Brooks    Chicago Bulls     0.0       PG

In [ ]:
# Selecting all of the rows and columns

df = pd.read_csv('/content/drive/MyDrive/nba.csv',index_col = "Name")
first = df.loc[:,["Team","Number","Position"]]
first

                                  Team  Number Position
Name
Aaron Brooks             Chicago Bulls     0.0       PG
Aaron Gordon             Orlando Magic     0.0       PF
Aaron Harrison       Charlotte Hornets     9.0       SG
Adreian Payne   Minnesota Timberwolves    33.0       PF
Al Horford               Atlanta Hawks    15.0        C
...                                ...     ...      ...
Xavier Munford       Memphis Grizzlies    14.0       PG
Zach LaVine     Minnesota Timberwolves     8.0       PG
Zach Randolph        Memphis Grizzlies    50.0       PF
Zaza Pachulia         Dallas Mavericks    27.0        C
NaN                                NaN     NaN      NaN

[458 rows x 3 columns]

(C) Indexing/Selection a DataFrame using .iloc[ ]

In [ ]:
# Selecting a single row

df = pd.read_csv('/content/drive/MyDrive/nba.csv',index_col = "Name")
row2 = df.iloc[3]
row2

Unnamed: 0                       404
Team          Minnesota Timberwolves
Number                          33.0
Position                          PF
Age                             25.0
Height                          6-10
Weight                         237.0
College               Michigan State
Salary                     1938840.0
Name: Adreian Payne, dtype: object

In [ ]:
# Selecting a multiple row

df = pd.read_csv('/content/drive/MyDrive/nba.csv',index_col = "Name")
row2 = df.iloc[[3,5,7]]
row2

,Unnamed: 0,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,,
Adreian Payne,404,Minnesota Timberwolves,33.0,PF,25.0,6-10,237.0,Michigan State,1938840.0
Al Jefferson,330,Charlotte Hornets,25.0,C,31.0,6-10,289.0,NaN,13500000.0
Alan Anderson,368,Washington Wizards,6.0,SG,33.0,6-6,220.0,Michigan State,4000000.0

In [ ]:
# Selecting a two row and two columns

df = pd.read_csv('/content/drive/MyDrive/nba.csv',index_col = "Name")
row2 = df.iloc[[3,4],[1,2]]
row2

                                 Team  Number
Name
Adreian Payne  Minnesota Timberwolves    33.0
Al Horford              Atlanta Hawks    15.0

In [ ]:
# Selecting a all rows and some columns

df = pd.read_csv('/content/drive/MyDrive/nba.csv',index_col = "Name")
row2 = df.iloc[:,[1,2]]
row2

                                  Team  Number
Name
Aaron Brooks             Chicago Bulls     0.0
Aaron Gordon             Orlando Magic     0.0
Aaron Harrison       Charlotte Hornets     9.0
Adreian Payne   Minnesota Timberwolves    33.0
Al Horford               Atlanta Hawks    15.0
...                                ...     ...
Xavier Munford       Memphis Grizzlies    14.0
Zach LaVine     Minnesota Timberwolves     8.0
Zach Randolph        Memphis Grizzlies    50.0
Zaza Pachulia         Dallas Mavericks    27.0
NaN                                NaN     NaN

[458 rows x 2 columns]

what is Axis in Pandas

In [ ]:
# Axes in Series

import pandas as pd
pd.Series(['red','green','blue','white','black'])

0      red
1    green
2     blue
3    white
4    black
dtype: object

In [ ]:
# Axes in DataFrame

import pandas as pd
srs_a = pd.Series([10,30,60,80,90])
srs_b = pd.Series(['red','green','blue','white','black'])
df = pd.DataFrame({'a':srs_a,'b':srs_b})
df

    a      b
0  10    red
1  30  green
2  60   blue
3  80  white
4  90  black

**DataFrame.loc[]**

let's create a DataFrame and explore how to use pandas loc[ ]

In [ ]:
import pandas as pd
technologies = {
    'Courses':['Spark','PySpark','Hadoop','Python','Pandas'],
    'Fee':[20000,25000,26000,22000,24000],
    'Duration':['30day','40day','35day','40day','60day'],
    'Discount':[1000,2300,1200,2500,2000]
}
index_labels=['r1','r2','r3','r4','r5']
df = pd.DataFrame(technologies,index=index_labels)
print(df)

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000    40day      2300
r3   Hadoop  26000    35day      1200
r4   Python  22000    40day      2500
r5   Pandas  24000    60day      2000

In [ ]:
# select single column by label
print(df.loc[:,"Courses"])

r1      Spark
r2    PySpark
r3     Hadoop
r4     Python
r5     Pandas
Name: Courses, dtype: object

In [ ]:
# select multiple rows by label
print(df.loc[['r2','r3']])

    Courses    Fee Duration  Discount
r2  PySpark  25000    40day      2300
r3   Hadoop  26000    35day      1200

In [ ]:
# select multiple columns by labels
print(df.loc[:,["Courses","Fee","Discount"]])

    Courses    Fee  Discount
r1    Spark  20000      1000
r2  PySpark  25000      2300
r3   Hadoop  26000      1200
r4   Python  22000      2500
r5   Pandas  24000      2000

In [ ]:
# select rows between two index labels
print(df.loc['r1':'r4'])

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000    40day      2300
r3   Hadoop  26000    35day      1200
r4   Python  22000    40day      2500

In [ ]:
# select columns between two labels
print(df.loc[:,'Fee':'Discount'])

      Fee Duration  Discount
r1  20000    30day      1000
r2  25000    40day      2300
r3  26000    35day      1200
r4  22000    40day      2500
r5  24000    60day      2000

In [ ]:
# select alternate rows by indeces
print(df.loc['r1':'r4':2])

   Courses    Fee Duration  Discount
r1   Spark  20000    30day      1000
r3  Hadoop  26000    35day      1200

In [ ]:
# select alternate columns between two labels
print(df.loc[:,'Fee':'Discount':2])

      Fee  Discount
r1  20000      1000
r2  25000      2300
r3  26000      1200
r4  22000      2500
r5  24000      2000

In [ ]:
# using condition
print(df.loc[df['Fee']>=24000])

    Courses    Fee Duration  Discount
r2  PySpark  25000    40day      2300
r3   Hadoop  26000    35day      1200
r5   Pandas  24000    60day      2000

**DataFrame.iloc[ ]**

In [ ]:
import pandas as pd
technologies = {
    'Courses':['Spark','PySpark','Hadoop','Python','Pandas'],
    'Fee':[20000,25000,26000,22000,24000],
    'Duration':['30day','40day','35day','40day','60day'],
    'Discount':[1000,2300,1200,2500,2000]
}
index_labels=['r1','r2','r3','r4','r5']
df = pd.DataFrame(technologies,index=index_labels)
print(df)

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000    40day      2300
r3   Hadoop  26000    35day      1200
r4   Python  22000    40day      2500
r5   Pandas  24000    60day      2000

In [ ]:
# select single row by index
print(df.iloc[1])

Courses     PySpark
Fee           25000
Duration      40day
Discount       2300
Name: r2, dtype: object

In [ ]:
# select single column by index
print(df.iloc[:,0])

r1      Spark
r2    PySpark
r3     Hadoop
r4     Python
r5     Pandas
Name: Courses, dtype: object

In [ ]:
# select multiple rows by index
print(df.iloc[[1,2]])

    Courses    Fee Duration  Discount
r2  PySpark  25000    40day      2300
r3   Hadoop  26000    35day      1200

In [ ]:
# select multiple column by index
print(df.iloc[:,[0,1,3]])

    Courses    Fee  Discount
r1    Spark  20000      1000
r2  PySpark  25000      2300
r3   Hadoop  26000      1200
r4   Python  22000      2500
r5   Pandas  24000      2000

In [ ]:
# select rows between two indexs
print(df.iloc[0:4])

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000    40day      2300
r3   Hadoop  26000    35day      1200
r4   Python  22000    40day      2500

In [ ]:
# select column between two indexes
print(df.iloc[:,1:4])

      Fee Duration  Discount
r1  20000    30day      1000
r2  25000    40day      2300
r3  26000    35day      1200
r4  22000    40day      2500
r5  24000    60day      2000

In [ ]:
# select alternative row by index
print(df.iloc[0:4:2])

   Courses    Fee Duration  Discount
r1   Spark  20000    30day      1000
r3  Hadoop  26000    35day      1200

In [ ]:
# select alternative columns between two indexes
print(df.iloc[:,1:4:2])

      Fee  Discount
r1  20000      1000
r2  25000      2300
r3  26000      1200
r4  22000      2500
r5  24000      2000

In [ ]:
# by condition
print(df.iloc[list(df['Fee']>=24000)])

    Courses    Fee Duration  Discount
r2  PySpark  25000    40day      2300
r3   Hadoop  26000    35day      1200
r5   Pandas  24000    60day      2000

In [ ]:
# select rows of DataFrame based on bool array
subsetdf = df.iloc[[True,False,True,False,False]]
print(subsetdf)

   Courses    Fee Duration  Discount
r1   Spark  20000    30day      1000
r3  Hadoop  26000    35day      1200

In [ ]:
# select column of DataFrame based on bool array
subsetdf = df.iloc[:,[True,False,True,False,False]]
print(subsetdf)

In [ ]:
# select a cell value from DataFrame
cellValue = df.iloc[3,2]
print(cellValue)

40day

In [ ]:
# select subset of the DataFrame based on row/Column indices in list
subsetdf = df.iloc[[1,3],[2,1]]
print(subsetdf)

   Duration    Fee
r2    40day  25000
r4    40day  22000

In [ ]:
# select subset of DatFrame based on row and column index range
subsetdf = df.iloc[1:4,1:4]
print(subsetdf)

      Fee Duration  Discount
r2  25000    40day      2300
r3  26000    35day      1200
r4  22000    40day      2500

In [ ]:
# change the value of 3rd row of DataFrame
df.iloc[2] = 0
print(df)

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000    40day      2300
r3        0      0        0         0
r4   Python  22000    40day      2500
r5   Pandas  24000    60day      2000

**Different operations on csv file (DataFrame)**

In [ ]:
import pandas as pd
df = pd.read_csv('/content/drive/MyDrive/nba.csv')
print(df)

     Unnamed: 0            Name                    Team  Number Position  \
0           152    Aaron Brooks           Chicago Bulls     0.0       PG
1           356    Aaron Gordon           Orlando Magic     0.0       PF
2           328  Aaron Harrison       Charlotte Hornets     9.0       SG
3           404   Adreian Payne  Minnesota Timberwolves    33.0       PF
4           312      Al Horford           Atlanta Hawks    15.0        C
..          ...             ...                     ...     ...      ...
453         270  Xavier Munford       Memphis Grizzlies    14.0       PG
454         402     Zach LaVine  Minnesota Timberwolves     8.0       PG
455         271   Zach Randolph       Memphis Grizzlies    50.0       PF
456         237   Zaza Pachulia        Dallas Mavericks    27.0        C
457         457             NaN                     NaN     NaN      NaN

      Age Height  Weight         College      Salary
0    31.0    6-0   161.0          Oregon   2250000.0
1    20.0    6-9   220.0         Arizona   4171680.0
2    21.0    6-6   210.0        Kentucky    525093.0
3    25.0   6-10   237.0  Michigan State   1938840.0
4    30.0   6-10   245.0         Florida  12000000.0
..    ...    ...     ...             ...         ...
453  24.0    6-3   180.0    Rhode Island         NaN
454  21.0    6-5   189.0            UCLA   2148360.0
455  34.0    6-9   260.0  Michigan State   9638555.0
456  32.0   6-11   275.0             NaN   5200000.0
457   NaN    NaN     NaN             NaN         NaN

[458 rows x 10 columns]

(A) Row selection

In [ ]:
# Extracting single row

import pandas as pd
data = pd.read_csv('/content/drive/MyDrive/nba.csv',index_col = "Name")
first = data.loc["Avery Bradley"]
second = data.loc["R.J. Hunter"]
print(first,"\n\n\n",second)

Unnamed: 0                 0
Team          Boston Celtics
Number                   0.0
Position                  PG
Age                     25.0
Height                   6-2
Weight                 180.0
College                Texas
Salary             7730337.0
Name: Avery Bradley, dtype: object


 Unnamed: 0                 3
Team          Boston Celtics
Number                  28.0
Position                  SG
Age                     22.0
Height                   6-5
Weight                 185.0
College        Georgia State
Salary             1148640.0
Name: R.J. Hunter, dtype: object

In [ ]:
# multiple parameters
data = pd.read_csv('/content/drive/MyDrive/nba.csv',index_col = "Name")
rows = data.loc[["Avery Bradley","R.J. Hunter"]]
print(rows)

               Unnamed: 0            Team  Number Position   Age Height  \
Name
Avery Bradley           0  Boston Celtics     0.0       PG  25.0    6-2
R.J. Hunter             3  Boston Celtics    28.0       SG  22.0    6-5

               Weight        College     Salary
Name
Avery Bradley   180.0          Texas  7730337.0
R.J. Hunter     185.0  Georgia State  1148640.0

In [ ]:
# Extract multiple rows with same index
data = pd.read_csv('/content/drive/MyDrive/nba.csv',index_col = "Team")
rows = data.loc["Chicago Bulls"]
rows

,Unnamed: 0,Name,Number,Position,Age,Height,Weight,College,Salary
Team,,,,,,,,,
Chicago Bulls,152,Aaron Brooks,0.0,PG,31.0,6-0,161.0,Oregon,2250000.0
Chicago Bulls,163,Bobby Portis,5.0,PF,21.0,6-11,230.0,Arkansas,1391160.0
Chicago Bulls,151,Cameron Bairstow,41.0,PF,25.0,6-9,250.0,New Mexico,845059.0
Chicago Bulls,155,Cristiano Felicio,6.0,PF,23.0,6-10,275.0,NaN,525093.0
Chicago Bulls,164,Derrick Rose,1.0,PG,27.0,6-3,190.0,Memphis,20093064.0
Chicago Bulls,159,Doug McDermott,3.0,SF,24.0,6-8,225.0,Creighton,2380440.0
Chicago Bulls,161,E'Twaun Moore,55.0,SG,27.0,6-4,191.0,Purdue,1015421.0
Chicago Bulls,153,Jimmy Butler,21.0,SG,26.0,6-7,220.0,Marquette,16407500.0
Chicago Bulls,162,Joakim Noah,13.0,C,31.0,6-11,232.0,Florida,13400000.0
Chicago Bulls,158,Justin Holiday,7.0,SG,27.0,6-6,185.0,Washington,947276.0
Chicago Bulls,154,Mike Dunleavy,34.0,SG,35.0,6-9,230.0,Duke,4500000.0
Chicago Bulls,160,Nikola Mirotic,44.0,PF,25.0,6-10,220.0,NaN,5543725.0
Chicago Bulls,156,Pau Gasol,16.0,C,35.0,7-0,250.0,NaN,7448760.0
Chicago Bulls,157,Taj Gibson,22.0,PF,30.0,6-9,225.0,USC,8500000.0
Chicago Bulls,165,Tony Snell,20.0,SF,24.0,6-7,200.0,New Mexico,1535880.0

In [ ]:
# extract rows between two index labels
data = pd.read_csv('/content/drive/MyDrive/nba.csv',index_col = "Name")
rows = data.loc["Avery Bradley":"Isaiah Thomas"]
rows

,Unnamed: 0,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,,
Avery Bradley,0,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Axel Toupane,397,Denver Nuggets,6.0,SG,23.0,6-7,210.0,NaN,NaN
Ben McLemore,148,Sacramento Kings,23.0,SG,23.0,6-5,195.0,Kansas,3156600.0
Bismack Biyombo,61,Toronto Raptors,8.0,C,23.0,6-9,245.0,NaN,2814000.0
Blake Griffin,96,Los Angeles Clippers,32.0,PF,27.0,6-10,251.0,Oklahoma,18907726.0
...,...,...,...,...,...,...,...,...,...
Ian Clark,79,Golden State Warriors,21.0,SG,25.0,6-3,175.0,Belmont,947276.0
Ian Mahinmi,204,Indiana Pacers,28.0,C,29.0,6-11,250.0,NaN,4000000.0
Iman Shumpert,177,Cleveland Cavaliers,4.0,SG,25.0,6-5,220.0,Georgia Tech,8988765.0
Isaiah Canaan,47,Philadelphia 76ers,0.0,PG,25.0,6-0,201.0,Murray State,947276.0
Isaiah Thomas,11,Boston Celtics,4.0,PG,27.0,5-9,185.0,Washington,6912869.0

(B) Row addition

In [ ]:
import pandas as pd
df = pd.read_csv('/content/drive/MyDrive/nba.csv',index_col = "Name")
df.head(10)

,Unnamed: 0,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,,
Aaron Brooks,152,Chicago Bulls,0.0,PG,31.0,6-0,161.0,Oregon,2250000.0
Aaron Gordon,356,Orlando Magic,0.0,PF,20.0,6-9,220.0,Arizona,4171680.0
Aaron Harrison,328,Charlotte Hornets,9.0,SG,21.0,6-6,210.0,Kentucky,525093.0
Adreian Payne,404,Minnesota Timberwolves,33.0,PF,25.0,6-10,237.0,Michigan State,1938840.0
Al Horford,312,Atlanta Hawks,15.0,C,30.0,6-10,245.0,Florida,12000000.0
Al Jefferson,330,Charlotte Hornets,25.0,C,31.0,6-10,289.0,NaN,13500000.0
Al-Farouq Aminu,428,Portland Trail Blazers,8.0,SF,25.0,6-9,215.0,Wake Forest,8042895.0
Alan Anderson,368,Washington Wizards,6.0,SG,33.0,6-6,220.0,Michigan State,4000000.0
Alan Williams,135,Phoenix Suns,15.0,C,23.0,6-8,260.0,UC Santa Barbara,83397.0
Alec Burks,444,Utah Jazz,10.0,SG,24.0,6-6,214.0,Colorado,9463484.0

In [ ]:
# Adding row at the top of given DataFrame by concatenating the old DataFrame with new one
df = pd.read_csv('/content/drive/MyDrive/nba.csv',index_col = "Name")
new_row = pd.DataFrame({
    'Name':'Garry','Team':'Boston','Number':3,'Position':'PG','Age':33,'Height':'6-2','Weight':189
,'College':'MIT','Salary':99999},index = [0])
df = pd.concat([new_row,df]).reset_index(drop = True)
df.head(5)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Unnamed: 0
0,Garry,Boston,3.0,PG,33.0,6-2,189.0,MIT,99999.0,NaN
1,NaN,Chicago Bulls,0.0,PG,31.0,6-0,161.0,Oregon,2250000.0,152.0
2,NaN,Orlando Magic,0.0,PF,20.0,6-9,220.0,Arizona,4171680.0,356.0
3,NaN,Charlotte Hornets,9.0,SG,21.0,6-6,210.0,Kentucky,525093.0,328.0
4,NaN,Minnesota Timberwolves,33.0,PF,25.0,6-10,237.0,Michigan State,1938840.0,404.0

In [ ]:
# Adding row at the top of given DataFrame by concatenating the old DataFrame with new one
df = pd.read_csv('/content/drive/MyDrive/nba.csv',index_col = "Name")
new_row = pd.DataFrame({
    'Name':'Garry','Team':'Boston','Number':3,'Position':'PG','Age':33,'Height':'6-2','Weight':189
,'College':'MIT','Salary':99999},index = [0])
df = pd.concat([new_row,df])
df.head(5)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Unnamed: 0
0,Garry,Boston,3.0,PG,33.0,6-2,189.0,MIT,99999.0,NaN
Aaron Brooks,NaN,Chicago Bulls,0.0,PG,31.0,6-0,161.0,Oregon,2250000.0,152.0
Aaron Gordon,NaN,Orlando Magic,0.0,PF,20.0,6-9,220.0,Arizona,4171680.0,356.0
Aaron Harrison,NaN,Charlotte Hornets,9.0,SG,21.0,6-6,210.0,Kentucky,525093.0,328.0
Adreian Payne,NaN,Minnesota Timberwolves,33.0,PF,25.0,6-10,237.0,Michigan State,1938840.0,404.0

(C) Row Deletion

In [ ]:
import pandas as pd
df = pd.read_csv('/content/drive/MyDrive/nba.csv',index_col = "Name")
data.drop(["Aaron Brooks","Aaron Gordon","Aaron Harrison"],inplace = True)
data

,Unnamed: 0,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,,
Adreian Payne,404,Minnesota Timberwolves,33.0,PF,25.0,6-10,237.0,Michigan State,1938840.0
Al Horford,312,Atlanta Hawks,15.0,C,30.0,6-10,245.0,Florida,12000000.0
Al Jefferson,330,Charlotte Hornets,25.0,C,31.0,6-10,289.0,NaN,13500000.0
Al-Farouq Aminu,428,Portland Trail Blazers,8.0,SF,25.0,6-9,215.0,Wake Forest,8042895.0
Alan Anderson,368,Washington Wizards,6.0,SG,33.0,6-6,220.0,Michigan State,4000000.0
...,...,...,...,...,...,...,...,...,...
Xavier Munford,270,Memphis Grizzlies,14.0,PG,24.0,6-3,180.0,Rhode Island,NaN
Zach LaVine,402,Minnesota Timberwolves,8.0,PG,21.0,6-5,189.0,UCLA,2148360.0
Zach Randolph,271,Memphis Grizzlies,50.0,PF,34.0,6-9,260.0,Michigan State,9638555.0
Zaza Pachulia,237,Dallas Mavericks,27.0,C,32.0,6-11,275.0,NaN,5200000.0
NaN,457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

**DEALING WITH COLUMNS**

(A) column selection

In [ ]:
# select two columns
import pandas as pd
data = {
    'Name':['jai','princi','gaurav','anuj'],
    'Age':[27,24,22,32],
    'Address':['Delhi','Kanpur','Allahabad','Kannauj'],
    'Qualification':['Msc','MA','MCA','PhD']
}
df = pd.DataFrame(data)
print(df[['Name','Qualification']])

     Name Qualification
0     jai           Msc
1  princi            MA
2  gaurav           MCA
3    anuj           PhD

In [ ]:
# select second to fourth columns
df[df.columns[1:4]]

   Age    Address Qualification
0   27      Delhi           Msc
1   24     Kanpur            MA
2   22  Allahabad           MCA
3   32    Kannauj           PhD

In [ ]:
# using loc[ ]
df.loc[1:3,['Name','Qualification']]

     Name Qualification
1  princi            MA
2  gaurav           MCA
3    anuj           PhD

In [ ]:
# first filtering row and selecting columns by label format and then select all columns
df.loc[0,:]

Name               jai
Age                 27
Address          Delhi
Qualification      Msc
Name: 0, dtype: object

In [ ]:
# using iloc[ ]
df.iloc[:,0:2]

     Name  Age
0     jai   27
1  princi   24
2  gaurav   22
3    anuj   32

(B) Column addition

In [ ]:
# add a new column
import pandas as pd
data = {
    'Name':['jai','princi','gaurav','anuj'],
    'Age':[27,24,22,32],
    'Address':['Delhi','Kanpur','Allahabad','Kannauj'],
    'Qualification':['Msc','MA','MCA','PhD']
}
df = pd.DataFrame(data)
height = [5.1,6.2,5.1,5.2]
df['Height']=height
print(df)

     Name  Age    Address Qualification  Height
0     jai   27      Delhi           Msc     5.1
1  princi   24     Kanpur            MA     6.2
2  gaurav   22  Allahabad           MCA     5.1
3    anuj   32    Kannauj           PhD     5.2

In [ ]:
# add new column using DataFrame.insert()
import pandas as pd
data = {
    'Name':['jai','princi','gaurav','anuj'],
    'Age':[27,24,22,32],
    'Address':['Delhi','Kanpur','Allahabad','Kannauj'],
    'Qualification':['Msc','MA','MCA','PhD']
}
df = pd.DataFrame(data)
df.insert(2,"Height",[5.1,6.2,5.1,5.2],True)
print(df)

     Name  Age  Height    Address Qualification
0     jai   27     5.1      Delhi           Msc
1  princi   24     6.2     Kanpur            MA
2  gaurav   22     5.1  Allahabad           MCA
3    anuj   32     5.2    Kannauj           PhD

(C) column deletion

In [ ]:
import pandas as pd
data = {
    'Name':['jai','princi','gaurav','anuj'],
    'Age':[27,24,22,32],
    'Address':['Delhi','Kanpur','Allahabad','Kannauj'],
    'Qualification':['Msc','MA','MCA','PhD']
}
df = pd.DataFrame(data)
data.drop(["Age"],axis=1,inplace=True)
print(data)

AttributeError: ignored